e-bike/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 	0;	//101325;		//0;

boundaryField
{
    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type        fixedValue;
        value       uniform 0;
    }

    left
    {
        type            zeroGradient;
    }

    right
    {
        type        zeroGradient;	//101325;		//0;
    }

    front
    {
        type            zeroGradient;
    }

    back
    {
        type            zeroGradient;
    }

    ebike
    {
        type            zeroGradient;
    }

    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
